vipr-portal/com.iwave.ext.windows/samples/enumerate/2-request.xml

<!-- Copyright 2012-2015 iWave Software LLC -->
<!-- All Rights Reserved -->

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
	xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration"
	xmlns:w="http://schemas.xmlsoap.org/ws/2005/06/management">
	<s:Header>
		<a:To>http://server:80/wsman</a:To>
		<w:ResourceURI s:mustUnderstand="true">
			http://schemas.microsoft.com/wsman/2005/06/wmi/root/mynamespace/myclass
		</w:ResourceURI>
		<a:ReplyTo>
			<a:Address s:mustUnderstand="true">
				http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
			</a:Address>
		</a:ReplyTo>
		<a:Action s:mustUnderstand="true">
			http://schemas.xmlsoap.org/ws/2004/09/enumeration/Pull
		</a:Action>
		<w:MaxEnvelopeSize s:mustUnderstand="true">
			51200
		</w:MaxEnvelopeSize>
		<a:MessageID>
			uuid:54E3FD6C-A83E-454C-A2F6-0BDABF5F14D7
		</a:MessageID>
		<w:OperationTimeout>PT60.000S</w:OperationTimeout>
	</s:Header>
	<s:Body>
		<n:Pull>
			<n:EnumerationContext
				xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration">
				uuid:22EB9809-5543-4020-A75C-FD95FF06217B
			</n:EnumerationContext>
			<n:MaxElements>1</n:MaxElements>
		</n:Pull>
	</s:Body>
</s:Envelope>